/*
Задача 19
Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
14212 -> нет
12821 -> да
23432 -> да
*/
/*
Console.Write("Введите число из 5 цифр: ");

string str1 = Console.ReadLine()!;

int count = str1.Length;

if (count == 5)
{
	if (str1[0] == str1[4] && str1[1] == str1[3])
		Console.WriteLine($"{str1} -> да");
	else Console.WriteLine($"{str1} -> нет");
}
else Console.WriteLine($"Введено не 5 цифр");
*/

/*------------------
Задача 21
Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
A (3,6,8); B (2,1,-7), -> 15.84
A (7,-5, 0); B (1,-1,9) -> 11.53
*/

int A, B;

Console.Write("Введите координаты первой точки: ");
Console.Write("Введите координаты второй точки: ");





/*------------------------
Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет
*/